package trening_01;

public class HW_01 {
    public static void main(String[] args) {
//1. Написать программу , определяющую является ли целое число положительным
        // отрицательным или нулем и выводит результат на экран
        // int x =


// 2.  Есть три переменные целого типа. Написать программу, определяющую
        // равны ли эти числа или нет. Программа должна выводить на экран следующие
        // сообщения: "Все числа равны" - если они равны, "Все числа разные"- если разные
        // "Некоторые из чисел равны"- если какие-то равны



//3. Есть три переменные целого типа x, y, z. Написать программу, определяющую
        // их последовательность - если значения возрастают (1,2,3), то программа печатает
        // increasing,   если убывают (3,2,1) - decreasing, и "не убывают и не возрастают"
        // во всех остальных случаях ( neither decreasing nor increasing)

int x= 2;
if ( x > 0) {
    System.out.println("number positive");
} else if ( x < 0)
if ( x < 0) {
    System.out.println("number negative");
}
}

}





